# Сушинський Ігор
# Лабораторна робота №2
# Інструкції циклів. Числові списки. Операції над списками
# Варіант 18

import funcsModule as fm

a = int(input("Введіть початок проміжку: a = "))
b = int(input("Введіть кінець проміжку: b = "))
h = int(input("Введіть крок проміжку: h = "))

print("================================")
list1 = fm.for_func(a, b, h)
print(f"1) Цикл for: {list1}")

print("================================")
list2 = fm.while_func(a, b, h)
print(f"2) Цикл while: {list2}")

print("================================")
a = int(input("Введіть початок зрізу: a = "))
b = int(input("Введіть кінець зрізу: b = "))
dx = int(input("Введіть крок зрізу: dx = "))

print(f"3) Зріз списку: {fm.slice_func(a, b, dx, list1)}")

print("================================")
print(f"Сума всіх елементів списку №1: {fm.sum_func(list1)}")
print(f"Максимальний елемент у списку №1: {fm.max_func(list1)}")
print(f"Мінімальний елемент у списку №1: {fm.min_func(list1)}")

print("================================")
print(f"Сума всіх елементів списку №2: {round(sum(list1), 3)}")
print(f"Максимальний елемент у списку №2: {max(list1)}")
print(f"Мінімальний елемент у списку №2: {min(list1)}")
print("================================")
